Revit 2026 API

# MultiReferenceAnnotationTypeIsAllowedDimensionStyle Method

---

Checks if the dimension style can be used with multi-reference annotations.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAllowedDimensionStyle(
	ElementId dimensionStyleId
)
```
```vb
Public Function IsAllowedDimensionStyle (
	dimensionStyleId As ElementId
) As Boolean
```
```cpp
public:
bool IsAllowedDimensionStyle(
	ElementId^ dimensionStyleId
)
```
```fsharp
member IsAllowedDimensionStyle :
        dimensionStyleId : ElementId -> bool
```

#### Parameters

dimensionStyleId ElementId
     The dimension style to check.

#### Return Value

Boolean True if the dimension style can be used by multi-reference annotations.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only linear dimension styles are allowed.

#### Reference

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace